from keras import backend as K
import numpy as np
import tensorflow as tf


# 也可以写程K.constant()
x2 = tf.constant([[[1, 1, 1, 1],
                   [2, 2, 2, 2],
                   [2, 3, 5, 8]],
                  [[3, 3, 3, 2],
                   [4, 4, 4, 4],
                   [2, 1, 2, 4]],
                  [[5, 5, 5, 5],
                   [6, 6, 6, 6],
                   [2, 1, 6, 9]]], dtype=tf.float32)

temp = K.repeat_elements(x2, rep=3, axis=0)  # (?, 78)   rep代表的是复制的次数。  
# 第零维度的数据重复的复制3次，获得的结果值。

# 在给定轴上重复张量元素rep次，与np.repeat类似。
# 例如，若xshape(s1, s2, s3)并且给定轴为axis=1`，输出张量的shape为`(s1, s2 * rep, s3)



init = tf.global_variables_initializer()
with tf.Session() as sess:
    sess.run(init)
    print(sess.run(temp))



# [[[1. 1. 1. 1.]
#   [2. 2. 2. 2.]
#   [2. 3. 5. 8.]]

#  [[1. 1. 1. 1.]
#   [2. 2. 2. 2.]
#   [2. 3. 5. 8.]]

#  [[1. 1. 1. 1.]
#   [2. 2. 2. 2.]
#   [2. 3. 5. 8.]]

#  [[3. 3. 3. 2.]
#   [4. 4. 4. 4.]
#   [2. 1. 2. 4.]]

#  [[3. 3. 3. 2.]
#   [4. 4. 4. 4.]
#   [2. 1. 2. 4.]]

#  [[3. 3. 3. 2.]
#   [4. 4. 4. 4.]
#   [2. 1. 2. 4.]]

#  [[5. 5. 5. 5.]
#   [6. 6. 6. 6.]
#   [2. 1. 6. 9.]]

#  [[5. 5. 5. 5.]
#   [6. 6. 6. 6.]
#   [2. 1. 6. 9.]]

#  [[5. 5. 5. 5.]
#   [6. 6. 6. 6.]
#   [2. 1. 6. 9.]]]










