str() 函数将对象转化为适于人阅读的形式。


参数
object -- 对象。
返回值
返回一个对象的string格式。

>>>s = 'RUNOOB'
>>> str(s)
'RUNOOB'
>>> dict = {'runoob': 'runoob.com', 'google': 'google.com'};
>>> str(dict)
"{'google': 'google.com', 'runoob': 'runoob.com'}"
>>>

#--------------------------------------------------------------------
a = [1,5,4]
print(str(a))
print(len(str(a)))

  # [1, 5, 4]  实际已经是字符串的形式来存储了。
  # 9  		    中间的空格占有一个长度。


⚠️注意：将列表、元组、字典和集合转换为字符串后，
包裹列表、元组、字典和集合的'['、']'、'('、')'、'{'、'}'，
以及列表、元组、字典和集合中的元素分隔符','，和字典中键值对':'也都转换成了字符串，是转换后字符串的一部分。




#---------------------------------------------------------------------------
>>> str(-23) #整数转换为字符串
'-23'
 
>>> str(1.3e2) #浮点数转换为字符串
'130.0'
 
>>> a_list = [12, '-23.1', 'Python']
>>> str(a_list)  #列表转换为字符串
"[12, '-23.1', 'Python']"   # 注意转换之后，中间是要有空格来隔开的，空格也占有一个字符的长度值。
>>> str(a_list)[0]
'['
 
>>> a_tuple = (23, '9we', -8.5)
>>> str(a_tuple)  #元组转换为字符串
"(23, '9we', -8.5)"
 
>>> a_dictionary = {'Huawei':'China', 'Apple':'USA'}
>>> str(a_dictionary)  #字典转换为字符串
"{'Huawei': 'China', 'Apple': 'USA'}"
>>> str(a_dictionary)[10]
' '
 
>>> a_set = {'China', 'Japan', 'UK'}
>>> str(a_set)  #集合转换为字符串
"{'Japan', 'UK', 'China'}"