
#---------------------------------------------------------------------------------------------------------------------------------------
%o —— oct 八进制
%d —— dec 十进制
%x —— hex 十六进制


print('%o' % 20)  # 八进制的形式进行输出。
# 24
print('%d' % 20)  # 十进制的形式进行输出。
#  20
print('%x' % 20)  # 16进制的形式进行输出。
# 14


num01=123456.8912

print("标准的模式：%f"%num01)

print("保留两位有效数字：%.2f"%(num01))

print("e的标准模式：%e"%num01)

print("e的留两位有效数字：%.2e"%num01)

print("g的标准模式：%g"%num01)		 # 如果是7位保留不了就用科学计数法表示

print("g的留两位有效数字：%.2g"%num01)


















