
import tensorflow as tf

aa = tf.constant([[[1, 1, 1], 
                   [2, 2, 2]], 

                   [[3, 3, 3], 
                    [4, 4, 4]]])

bb = tf.constant([[[5, 5, 5], 
                   [6, 6, 6]], 
                   
                  [[7, 7, 7], 
                   [8, 8, 8]]])

with tf.Session() as sess:
    t3 = tf.concat([aa, bb], 0)
    print(sess.run(t3))





"""
第0维度的联合的输出的结果为  t3 = tf.concat([aa, bb], 0)
[[[1 1 1]
  [2 2 2]]

 [[3 3 3]
  [4 4 4]]

 [[5 5 5]
  [6 6 6]]

 [[7 7 7]
  [8 8 8]]]

第1维度的输出的结果为    t3 = tf.concat([aa, bb], 1)

[[[1 1 1]
  [2 2 2]
  [5 5 5]
  [6 6 6]]

 [[3 3 3]
  [4 4 4]
  [7 7 7]
  [8 8 8]]]

第2维度的输出的结果为    t3 = tf.concat([aa, bb], 2)


[[[1 1 1 5 5 5]
  [2 2 2 6 6 6]]

 [[3 3 3 7 7 7]
  [4 4 4 8 8 8]]]

"""
